apache/nuttx/arch/arm/src/rp2040/rp2040_usbdev.c
/****************************************************************************
 * arch/arm/src/rp2040/rp2040_usbdev.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <assert.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/spinlock.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include "chip.h"
#include "arm_internal.h"
#include "rp2040_usbdev.h"

#include "hardware/rp2040_resets.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#ifndef CONFIG_USBDEV_EP0_MAXSIZE
#  define CONFIG_USBDEV_EP0_MAXSIZE 64
#endif

#ifndef CONFIG_USBDEV_SETUP_MAXDATASIZE
#  define CONFIG_USBDEV_SETUP_MAXDATASIZE (CONFIG_USBDEV_EP0_MAXSIZE * 4)
#endif

/* Debug ********************************************************************/

/* Trace error codes */

#define RP2040_TRACEERR_ALLOCFAIL         0x0001
#define RP2040_TRACEERR_BINDFAILED        0x0002
#define RP2040_TRACEERR_DRIVER            0x0003
#define RP2040_TRACEERR_EPREAD            0x0004
#define RP2040_TRACEERR_EWRITE            0x0005
#define RP2040_TRACEERR_INVALIDPARMS      0x0006
#define RP2040_TRACEERR_IRQREGISTRATION   0x0007
#define RP2040_TRACEERR_NULLPACKET        0x0008
#define RP2040_TRACEERR_NULLREQUEST       0x0009
#define RP2040_TRACEERR_REQABORTED        0x000a
#define RP2040_TRACEERR_STALLEDCLRFEATURE 0x000b
#define RP2040_TRACEERR_STALLEDISPATCH    0x000c
#define RP2040_TRACEERR_STALLEDGETST      0x000d
#define RP2040_TRACEERR_STALLEDGETSTEP    0x000e
#define RP2040_TRACEERR_STALLEDGETSTRECIP 0x000f
#define RP2040_TRACEERR_STALLEDREQUEST    0x0010
#define RP2040_TRACEERR_STALLEDSETFEATURE 0x0011
#define RP2040_TRACEERR_TXREQLOST         0x0012
#define RP2040_TRACEERR_RXREQLOST         0x0013

/* Trace interrupt codes */

#define RP2040_TRACEINTID_GETSTATUS       1
#define RP2040_TRACEINTID_GETIFDEV        2
#define RP2040_TRACEINTID_CLEARFEATURE    3
#define RP2040_TRACEINTID_SETFEATURE      4
#define RP2040_TRACEINTID_TESTMODE        5
#define RP2040_TRACEINTID_SETADDRESS      6
#define RP2040_TRACEINTID_GETSETDESC      7
#define RP2040_TRACEINTID_GETSETIFCONFIG  8
#define RP2040_TRACEINTID_SYNCHFRAME      9
#define RP2040_TRACEINTID_DISPATCH       10
#define RP2040_TRACEINTID_GETENDPOINT    11
#define RP2040_TRACEINTID_HANDLEZLP      12
#define RP2040_TRACEINTID_USBINTERRUPT   13
#define RP2040_TRACEINTID_INTR_BUSRESET  14
#define RP2040_TRACEINTID_INTR_BUFFSTAT  15
#define RP2040_TRACEINTID_INTR_SETUP     16
#define RP2040_TRACEINTID_EPOUTQEMPTY    17

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(RP2040_TRACEERR_ALLOCFAIL),
  TRACE_STR(RP2040_TRACEERR_BINDFAILED),
  TRACE_STR(RP2040_TRACEERR_DRIVER),
  TRACE_STR(RP2040_TRACEERR_EPREAD),
  TRACE_STR(RP2040_TRACEERR_EWRITE),
  TRACE_STR(RP2040_TRACEERR_INVALIDPARMS),
  TRACE_STR(RP2040_TRACEERR_IRQREGISTRATION),
  TRACE_STR(RP2040_TRACEERR_NULLPACKET),
  TRACE_STR(RP2040_TRACEERR_NULLREQUEST),
  TRACE_STR(RP2040_TRACEERR_REQABORTED),
  TRACE_STR(RP2040_TRACEERR_STALLEDCLRFEATURE),
  TRACE_STR(RP2040_TRACEERR_STALLEDISPATCH),
  TRACE_STR(RP2040_TRACEERR_STALLEDGETST),
  TRACE_STR(RP2040_TRACEERR_STALLEDGETSTEP),
  TRACE_STR(RP2040_TRACEERR_STALLEDGETSTRECIP),
  TRACE_STR(RP2040_TRACEERR_STALLEDREQUEST),
  TRACE_STR(RP2040_TRACEERR_STALLEDSETFEATURE),
  TRACE_STR(RP2040_TRACEERR_TXREQLOST),
  TRACE_STR(RP2040_TRACEERR_RXREQLOST),
  TRACE_STR_END
};

const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(RP2040_TRACEINTID_GETSTATUS),
  TRACE_STR(RP2040_TRACEINTID_GETIFDEV),
  TRACE_STR(RP2040_TRACEINTID_CLEARFEATURE),
  TRACE_STR(RP2040_TRACEINTID_SETFEATURE),
  TRACE_STR(RP2040_TRACEINTID_TESTMODE),
  TRACE_STR(RP2040_TRACEINTID_SETADDRESS),
  TRACE_STR(RP2040_TRACEINTID_GETSETDESC),
  TRACE_STR(RP2040_TRACEINTID_GETSETIFCONFIG),
  TRACE_STR(RP2040_TRACEINTID_SYNCHFRAME),
  TRACE_STR(RP2040_TRACEINTID_DISPATCH),
  TRACE_STR(RP2040_TRACEINTID_GETENDPOINT),
  TRACE_STR(RP2040_TRACEINTID_HANDLEZLP),
  TRACE_STR(RP2040_TRACEINTID_USBINTERRUPT),
  TRACE_STR(RP2040_TRACEINTID_INTR_BUSRESET),
  TRACE_STR(RP2040_TRACEINTID_INTR_BUFFSTAT),
  TRACE_STR(RP2040_TRACEINTID_INTR_SETUP),
  TRACE_STR(RP2040_TRACEINTID_EPOUTQEMPTY),
  TRACE_STR_END
};
#endif

/* Hardware interface *******************************************************/

/* Hardware dependent sizes and numbers */

#define RP2040_EP0MAXPACKET     64        /* EP0 max packet size */
#define RP2040_BULKMAXPACKET    64        /* Bulk endpoint max packet */
#define RP2040_INTRMAXPACKET    64        /* Interrupt endpoint max packet */
#define RP2040_ISOMAXPACKET     1023      /* Isochronous max packet size */

/* USB endpoint number conversion macros
 * EPINDEX: eplist[] index (the endpoint list in rp2040_usbdev_s)
 *   0 - Endpoint  0 IN
 *   1 - Endpoint  0 OUT
 *   2 - Endpoint  1 (IN or OUT - depends on the endpoint configuration)
 *   3 - Endpoint  2 (IN or OUT - depends on the endpoint configuration)
 *   4 - Endpoint  3 (IN or OUT - depends on the endpoint configuration)
 *     :
 *  15 - Endpoint 14 (IN or OUT - depends on the endpoint configuration)
 *  16 - Endpoint 15 (IN or OUT - depends on the endpoint configuration)
 *
 * DPINDEX: RP2040 DPSRAM control index
 *   0 - Endpoint  0 IN
 *   1 - Endpoint  0 OUT
 *   2 - Endpoint  1 IN
 *   3 - Endpoint  1 OUT
 *   4 - Endpoint  2 IN
 *   5 - Endpoint  2 OUT
 *     :
 *  30 - Endpoint 15 IN
 *  31 - Endpoint 15 OUT
 */

#define RP2040_EPINDEX(eplog)   (USB_EPNO(eplog) == 0 ? \
                                 (USB_ISEPIN(eplog) ? 0 : 1) : \
                                 (USB_EPNO(eplog) + 1))
#define RP2040_DPINDEX(eplog)   (USB_EPNO(eplog) * 2 + USB_ISEPOUT(eplog))
#define RP2040_DPTOEP(index)    ((index) < 2 ? (index) : (index) / 2 + 1)

