apache/nuttx/arch/arm/src/rp2040/rp2040_usbdev.c
#define RP2040_NENDPOINTS       (16 + 1)  /* EP0 IN, EP0 OUT, EP1..EP15 */

/* Request queue operations *************************************************/

#define rp2040_rqempty(ep)      ((ep)->head == NULL)
#define rp2040_rqpeek(ep)       ((ep)->head)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* USB Zero Length Packet type */

enum rp2040_zlp_e
{
  RP2040_ZLP_NONE = 0,        /* Don't send/receive Zero Length Packet */
  RP2040_ZLP_IN_REPLY,        /* Receive ZLP to reply IN transfer */
  RP2040_ZLP_OUT_REPLY,       /* Send ZLP to reply OUT transfer */
};

/* A container for a request so that the request make be retained in a list */

struct rp2040_req_s
{
  struct usbdev_req_s req;        /* Standard USB request */
  struct rp2040_req_s *flink;     /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

struct rp2040_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct rp2040_ep_s.
   */

  struct usbdev_ep_s ep;          /* Standard endpoint structure */

  /* RP2040-specific fields */

  struct rp2040_usbdev_s *dev;    /* Reference to private driver data */
  struct rp2040_req_s *head;      /* Request list for this endpoint */
  struct rp2040_req_s *tail;
  uint8_t *data_buf;              /* DPSRAM buffer address */
  uint32_t ep_ctrl;               /* DPSRAM EP control register address */
  uint32_t buf_ctrl;              /* DPSRAM buffer control register address */
  int     next_pid;               /* Next PID 0:DATA0, 1:DATA1 */
  uint8_t type;                   /* 0:cont, 1:iso, 2:bulk, 3:int */
  uint8_t epphy;                  /* Physical EP address */
  bool    txnullpkt;              /* Null packet needed at end of transfer */
  bool    in;                     /* in = true, out = false */
  bool    stalled;                /* The EP is stalled */
  bool    pending_stall;          /* Pending stall request */
};

/* This structure encapsulates the overall driver state */

struct rp2040_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s
   * to struct rp2040_usbdev_s.
   */

  struct usbdev_s usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* RP2040-specific fields */

  uint16_t next_offset;       /* Unused DPSRAM buffer offset */
  uint8_t  dev_addr;          /* USB device address */
  spinlock_t lock;            /* USB device address */
  enum rp2040_zlp_e zlp_stat; /* Pending EP0 ZLP status */
  uint16_t used;              /* used epphy */
  bool stalled;
  bool selfpowered;           /* 1: Device is self powered */

  /* EP0 SETUP data buffering.
   *
   * ctrl
   *   The 8-byte SETUP request is received on the EP0 OUT endpoint and is
   *   saved.
   *
   * ep0data
   *   For OUT SETUP requests, the SETUP data phase must also complete before
   *   the SETUP command can be processed.
   *
   * ep0datlen
   *   Length of OUT DATA received in ep0data[]
   */

  struct usb_ctrlreq_s ctrl;  /* Last EP0 request */

  uint8_t ep0data[CONFIG_USBDEV_SETUP_MAXDATASIZE];
  uint16_t ep0datlen;
  uint16_t ep0reqlen;

  /* The endpoint list */

  struct rp2040_ep_s eplist[RP2040_NENDPOINTS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Request queue operations *************************************************/

static struct
rp2040_req_s *rp2040_rqdequeue(struct rp2040_ep_s *privep);
static void rp2040_rqenqueue(struct rp2040_ep_s *privep,
                             struct rp2040_req_s *req);

/* Low level data transfers and request operations */

static void rp2040_update_buffer_control(struct rp2040_ep_s *privep,
                                         uint32_t and_mask,
                                         uint32_t or_mask);
static int rp2040_epwrite(struct rp2040_ep_s *privep, uint8_t *buf,
                          uint16_t nbytes);
static int rp2040_epread(struct rp2040_ep_s *privep, uint16_t nbytes);
static void rp2040_abortrequest(struct rp2040_ep_s *privep,
                                struct rp2040_req_s *privreq,
                                int16_t result);
static void rp2040_reqcomplete(struct rp2040_ep_s *privep, int16_t result);
static void rp2040_txcomplete(struct rp2040_ep_s *privep);
static int rp2040_wrrequest(struct rp2040_ep_s *privep);
static void rp2040_rxcomplete(struct rp2040_ep_s *privep);
static int rp2040_rdrequest(struct rp2040_ep_s *privep);

static void rp2040_handle_zlp(struct rp2040_usbdev_s *priv);

static void rp2040_cancelrequests(struct rp2040_ep_s *privep);
static struct rp2040_ep_s *
rp2040_epfindbyaddr(struct rp2040_usbdev_s *priv, uint16_t eplog);
static void rp2040_dispatchrequest(struct rp2040_usbdev_s *priv);
static void rp2040_ep0setup(struct rp2040_usbdev_s *priv);

/* Interrupt handling */

static void rp2040_usbintr_setup(struct rp2040_usbdev_s *priv);
static void rp2040_usbintr_ep0out(struct rp2040_usbdev_s *priv,
                                  struct rp2040_ep_s *privep);
static bool rp2040_usbintr_buffstat(struct rp2040_usbdev_s *priv);
static void rp2040_usbintr_busreset(struct rp2040_usbdev_s *priv);
static int rp2040_usbinterrupt(int irq, void *context, void *arg);

/* Endpoint methods */

static int rp2040_epconfigure(struct usbdev_ep_s *ep,
                              const struct usb_epdesc_s *desc,
                              bool last);

static int rp2040_epdisable(struct usbdev_ep_s *ep);
static struct usbdev_req_s *rp2040_epallocreq(struct usbdev_ep_s
                                                  *ep);
static void rp2040_epfreereq(struct usbdev_ep_s *ep,
                             struct usbdev_req_s *req);
static int rp2040_epsubmit(struct usbdev_ep_s *ep,
                           struct usbdev_req_s *privreq);
static int rp2040_epcancel(struct usbdev_ep_s *ep,
                           struct usbdev_req_s *privreq);
static int rp2040_epstall_exec(struct usbdev_ep_s *ep);
static int rp2040_epstall(struct usbdev_ep_s *ep, bool resume);

/* USB device controller methods */

static struct usbdev_ep_s *rp2040_allocep(struct usbdev_s *dev,
                                          uint8_t epno, bool in,
                                          uint8_t eptype);
static void rp2040_freeep(struct usbdev_s *dev,
                          struct usbdev_ep_s *ep);
static int rp2040_getframe(struct usbdev_s *dev);
static int rp2040_wakeup(struct usbdev_s *dev);
static int rp2040_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int rp2040_pullup(struct usbdev_s *dev, bool enable);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Endpoint methods */

static const struct usbdev_epops_s g_epops =
{
  .configure   = rp2040_epconfigure,
  .disable     = rp2040_epdisable,
  .allocreq    = rp2040_epallocreq,
  .freereq     = rp2040_epfreereq,
  .submit      = rp2040_epsubmit,
  .cancel      = rp2040_epcancel,
  .stall       = rp2040_epstall,
};

/* USB controller device methods */

static const struct usbdev_ops_s g_devops =
{
  .allocep     = rp2040_allocep,
  .freeep      = rp2040_freeep,
  .getframe    = rp2040_getframe,
  .wakeup      = rp2040_wakeup,
  .selfpowered = rp2040_selfpowered,
  .pullup      = rp2040_pullup,
};

static struct rp2040_usbdev_s g_usbdev;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rp2040_rqdequeue
 *
 * Description:
 *   Remove a request from an endpoint request queue
 *
 ****************************************************************************/

static struct
rp2040_req_s *rp2040_rqdequeue(struct rp2040_ep_s *privep)
{
  struct rp2040_req_s *ret = privep->head;

  if (ret)
    {
      privep->head = ret->flink;
      if (!privep->head)
        {
          privep->tail = NULL;
        }

      ret->flink = NULL;
    }

  return ret;
}

/****************************************************************************
 * Name: rp2040_rqenqueue
 *
 * Description:
 *   Add a request from an endpoint request queue
 *
 ****************************************************************************/

