apache/nuttx/arch/arm/src/rp2040/rp2040_usbdev.c
static void rp2040_rqenqueue(struct rp2040_ep_s *privep,
                             struct rp2040_req_s *req)
{
  req->flink = NULL;
  if (!privep->head)
    {
      privep->head = req;
      privep->tail = req;
    }
  else
    {
      privep->tail->flink = req;
      privep->tail        = req;
    }
}

/****************************************************************************
 * Name: rp2040_update_buffer_control
 *
 * Description:
 *   Update DPSRAM buffer control register
 *
 ****************************************************************************/

static void rp2040_update_buffer_control(struct rp2040_ep_s *privep,
                                         uint32_t and_mask,
                                         uint32_t or_mask)
{
  uint32_t value = 0;

  if (and_mask)
    {
      value = getreg32(privep->buf_ctrl) & and_mask;
    }

  if (or_mask)
    {
      value |= or_mask;
    }

  putreg32(value, privep->buf_ctrl);
}

/****************************************************************************
 * Name: rp2040_epwrite
 *
 * Description:
 *   Endpoint write (IN)
 *
 ****************************************************************************/

static int rp2040_epwrite(struct rp2040_ep_s *privep, uint8_t *buf,
                          uint16_t nbytes)
{
  struct rp2040_usbdev_s *priv = privep->dev;
  uint32_t val;
  irqstate_t flags;

  /* Copy the transmit data into DPSRAM */

  memcpy(privep->data_buf, buf, nbytes);

  val = nbytes |
        RP2040_USBCTRL_DPSRAM_EP_BUFF_CTRL_AVAIL |
        RP2040_USBCTRL_DPSRAM_EP_BUFF_CTRL_FULL |
        (privep->next_pid ?
         RP2040_USBCTRL_DPSRAM_EP_BUFF_CTRL_DATA1_PID : 0);

  privep->next_pid = 1 - privep->next_pid;    /* Invert DATA0 <-> DATA1 */

  /* Start the transfer */

  flags = spin_lock_irqsave(&priv->lock);
  rp2040_update_buffer_control(privep, 0, val);
  spin_unlock_irqrestore(&priv->lock, flags);

  return nbytes;
}

/****************************************************************************
 * Name: rp2040_epread
 *
 * Description:
 *   Endpoint read (OUT)
 *
 ****************************************************************************/

static int rp2040_epread(struct rp2040_ep_s *privep, uint16_t nbytes)
{
  struct rp2040_usbdev_s *priv = privep->dev;
  uint32_t val;
  irqstate_t flags;

  val = nbytes |
        RP2040_USBCTRL_DPSRAM_EP_BUFF_CTRL_AVAIL |
        (privep->next_pid ?
         RP2040_USBCTRL_DPSRAM_EP_BUFF_CTRL_DATA1_PID : 0);

  privep->next_pid = 1 - privep->next_pid;    /* Invert DATA0 <-> DATA1 */

  /* Start the transfer */

  flags = spin_lock_irqsave(&priv->lock);
  rp2040_update_buffer_control(privep, 0, val);
  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

/****************************************************************************
 * Name: rp2040_abortrequest
 *
 * Description:
 *   Discard a request
 *
 ****************************************************************************/

static void rp2040_abortrequest(struct rp2040_ep_s *privep,
                                struct rp2040_req_s *privreq,
                                int16_t result)
{
  usbtrace(TRACE_DEVERROR(RP2040_TRACEERR_REQABORTED),
          (uint16_t)privep->epphy);

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);
}

/****************************************************************************
 * Name: rp2040_reqcomplete
 *
 * Description:
 *   Handle termination of a request.
 *
 ****************************************************************************/

static void rp2040_reqcomplete(struct rp2040_ep_s *privep, int16_t result)
{
  struct rp2040_req_s *privreq;
  int stalled = privep->stalled;
  irqstate_t flags;

  /* Remove the completed request at the head of the endpoint request list */

  flags = enter_critical_section();
  privreq = rp2040_rqdequeue(privep);
  leave_critical_section(flags);

  if (privreq)
    {
      /* If endpoint 0, temporarily reflect the state of protocol stalled
       * in the callback.
       */

      if (privep->epphy == 0)
        {
          privep->stalled = privep->dev->stalled;
        }

      /* Save the result in the request structure */

      privreq->req.result = result;

      /* Callback to the request completion handler */

      privreq->flink = NULL;
      privreq->req.callback(&privep->ep, &privreq->req);

      /* Restore the stalled indication */

      privep->stalled = stalled;
    }
}

/****************************************************************************
 * Name: rp2040_txcomplete
 *
 * Description:
 *   Transfer is completed.
 *
 ****************************************************************************/

static void rp2040_txcomplete(struct rp2040_ep_s *privep)
{
  struct rp2040_req_s *privreq;

  privreq = rp2040_rqpeek(privep);
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(RP2040_TRACEERR_TXREQLOST), privep->epphy);
    }
  else
    {
      privreq->req.xfrd += getreg32(privep->buf_ctrl)
                           & RP2040_USBCTRL_DPSRAM_EP_BUFF_CTRL_LEN_MASK;

      if (privreq->req.xfrd >= privreq->req.len && !privep->txnullpkt)
        {
          usbtrace(TRACE_COMPLETE(privep->epphy), privreq->req.xfrd);
          privep->txnullpkt = 0;
          rp2040_reqcomplete(privep, OK);
        }
    }

  rp2040_wrrequest(privep);
}

/****************************************************************************
 * Name: rp2040_wrrequest
 *
 * Description:
 *   Send from the next queued write request
 *
 ****************************************************************************/

static int rp2040_wrrequest(struct rp2040_ep_s *privep)
{
  struct rp2040_req_s *privreq;
  uint8_t *buf;
  int nbytes;
  int bytesleft;

  /* Check the request from the head of the endpoint request queue */

  privreq = rp2040_rqpeek(privep);
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(RP2040_TRACEERR_NULLREQUEST), 0);
      return OK;
    }

  /* Ignore any attempt to send a zero length packet on anything but EP0IN */

