apache/nuttx/arch/arm/src/rp2040/rp2040_usbdev.c
  if (privreq->req.len == 0)
    {
      if (privep->epphy == 0)
        {
          rp2040_epwrite(privep, NULL, 0);
        }
      else
        {
          usbtrace(TRACE_DEVERROR(RP2040_TRACEERR_NULLPACKET), 0);
        }

      return OK;
    }

  /* Get the number of bytes left to be sent in the packet */

  bytesleft = privreq->req.len - privreq->req.xfrd;

  /* Send the next packet if (1) there are more bytes to be sent, or
   * (2) the last packet sent was exactly maxpacketsize (bytesleft == 0)
   */

  usbtrace(TRACE_WRITE(privep->epphy), (uint16_t)bytesleft);
  if (bytesleft > 0 || privep->txnullpkt)
    {
      /* Try to send maxpacketsize -- unless we don't have that many
       * bytes to send.
       */

      privep->txnullpkt = 0;
      if (bytesleft > privep->ep.maxpacket)
        {
          nbytes = privep->ep.maxpacket;
        }
      else
        {
          nbytes = bytesleft;
          if ((privreq->req.flags & USBDEV_REQFLAGS_NULLPKT) != 0)
            {
              privep->txnullpkt = (bytesleft == privep->ep.maxpacket);
            }
        }

      /* Send the largest number of bytes that we can in this packet */

      buf = privreq->req.buf + privreq->req.xfrd;
      rp2040_epwrite(privep, buf, nbytes);
    }

  return OK;
}

/****************************************************************************
 * Name: rp2040_rxcomplete
 *
 * Description:
 *   Notify the upper layer and continue to next receive request.
 *
 ****************************************************************************/

static void rp2040_rxcomplete(struct rp2040_ep_s *privep)
{
  struct rp2040_req_s *privreq;
  uint16_t nrxbytes;

  nrxbytes = getreg32(privep->buf_ctrl)
             & RP2040_USBCTRL_DPSRAM_EP_BUFF_CTRL_LEN_MASK;

  privreq = rp2040_rqpeek(privep);
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(RP2040_TRACEERR_RXREQLOST), privep->epphy);
      return;
    }

  memcpy(privreq->req.buf + privreq->req.xfrd, privep->data_buf, nrxbytes);

  privreq->req.xfrd += nrxbytes;

  if (privreq->req.xfrd >= privreq->req.len ||
      nrxbytes < privep->ep.maxpacket)
    {
      usbtrace(TRACE_COMPLETE(privep->epphy), privreq->req.xfrd);
      rp2040_reqcomplete(privep, OK);
    }

  rp2040_rdrequest(privep);
}

/****************************************************************************
 * Name: rp2040_rdrequest
 *
 * Description:
 *   Receive to the next queued read request
 *
 ****************************************************************************/

static int rp2040_rdrequest(struct rp2040_ep_s *privep)
{
  struct rp2040_req_s *privreq;

  /* Check the request from the head of the endpoint request queue */

  privreq = rp2040_rqpeek(privep);
  if (!privreq)
    {
      usbtrace(TRACE_INTDECODE(RP2040_TRACEINTID_EPOUTQEMPTY), 0);
      return OK;
    }

  /* Receive the next packet */

  usbtrace(TRACE_READ(privep->epphy), privreq->req.len);

  return rp2040_epread(privep, privreq->req.len);
}

/****************************************************************************
 * Name: rp2040_handle_zlp
 *
 * Description:
 *   Handle Zero Length Packet to reply to the control transfer
 *
 ****************************************************************************/

static void rp2040_handle_zlp(struct rp2040_usbdev_s *priv)
{
  struct rp2040_ep_s *privep = NULL;

  switch (priv->zlp_stat)
    {
      case RP2040_ZLP_NONE:
        return;

      case RP2040_ZLP_IN_REPLY:

        /* Reply to control IN  : receive ZLP from EP0 (0x00) */

        privep = &priv->eplist[RP2040_EPINDEX(0x00)];
        break;

      case RP2040_ZLP_OUT_REPLY:

        /* Reply to control OUT : send ZLP to EP0 (0x80) */

        privep = &priv->eplist[RP2040_EPINDEX(0x80)];
        break;

      default:
        DEBUGPANIC();
    }

  usbtrace(TRACE_INTDECODE(RP2040_TRACEINTID_HANDLEZLP), privep->ep.eplog);
  privep->next_pid = 1;   /* ZLP is always sent by DATA1 packet */

  if (priv->zlp_stat == RP2040_ZLP_IN_REPLY)
    {
      rp2040_epread(privep, 0);
    }
  else
    {
      rp2040_epwrite(privep, NULL, 0);
    }

  priv->zlp_stat = RP2040_ZLP_NONE;
}

/****************************************************************************
 * Name: rp2040_cancelrequests
 *
 * Description:
 *   Cancel all pending requests for an endpoint
 *
 ****************************************************************************/

static void rp2040_cancelrequests(struct rp2040_ep_s *privep)
{
  while (!rp2040_rqempty(privep))
    {
      usbtrace(TRACE_COMPLETE(privep->epphy),
               (rp2040_rqpeek(privep))->req.xfrd);
      rp2040_reqcomplete(privep, -ESHUTDOWN);
    }
}

/****************************************************************************
 * Name: rp2040_epfindbyaddr
 *
 * Description:
 *   Find the physical endpoint structure corresponding to a logic endpoint
 *   address
 *
 ****************************************************************************/

static struct rp2040_ep_s *
rp2040_epfindbyaddr(struct rp2040_usbdev_s *priv, uint16_t eplog)
{
  return &priv->eplist[RP2040_EPINDEX(eplog)];
}

/****************************************************************************
 * Name: rp2040_dispatchrequest
 *
 * Description:
 *   Provide unhandled setup actions to the class driver
 *
 ****************************************************************************/

static void rp2040_dispatchrequest(struct rp2040_usbdev_s *priv)
{
  int ret;

  usbtrace(TRACE_INTDECODE(RP2040_TRACEINTID_DISPATCH), 0);
  if (priv && priv->driver)
    {
      ret = CLASS_SETUP(priv->driver, &priv->usbdev, &priv->ctrl,
                        priv->ep0data, priv->ep0datlen);
      if (ret < 0)
        {
          /* Stall on failure */

          usbtrace(TRACE_DEVERROR(RP2040_TRACEERR_STALLEDISPATCH),
                   priv->ctrl.req);
          priv->stalled = true;
        }

      if (!priv->stalled && USB_REQ_ISOUT(priv->ctrl.type))
        {
          priv->zlp_stat = RP2040_ZLP_NONE; /* already sent */
        }
    }
}

/****************************************************************************
 * Name: rp2040_ep0setup
 *
 * Description:
 *   USB control EP setup event
 *
 ****************************************************************************/

