apache/nuttx/arch/arm/src/rp2040/rp2040_usbdev.c
          case USB_REQ_SETCONFIGURATION:
            /* type:  host-to-device; recipient = device
             * value: configuration value
             * index: 0;
             * len:   0; data = none
             */

          case USB_REQ_GETINTERFACE:
            /* type:  device-to-host; recipient = interface
             * value: 0
             * index: interface;
             * len:   1; data = alt interface
             */

          case USB_REQ_SETINTERFACE:
            /* type:  host-to-device; recipient = interface
             * value: alternate setting
             * index: interface;
             * len:   0; data = none
             */

            {
              usbtrace(TRACE_INTDECODE(RP2040_TRACEINTID_GETSETIFCONFIG),
                       priv->ctrl.req);
              rp2040_dispatchrequest(priv);
            }
            break;

          case USB_REQ_SYNCHFRAME:
              /* type:  device-to-host; recipient = endpoint
               * value: 0
               * index: endpoint;
               * len:   2; data = frame number
               */

            {
              usbtrace(TRACE_INTDECODE(RP2040_TRACEINTID_SYNCHFRAME), 0);
              break;
            }

          default:
            {
              usbtrace(TRACE_DEVERROR(RP2040_TRACEERR_STALLEDREQUEST),
                       priv->ctrl.req);
              priv->stalled = true;
            }
            break;
        }
    }

  /* Check if the setup processing resulted in a STALL */

  if (priv->stalled)
    {
      rp2040_epstall(&priv->eplist[0].ep, false);
      rp2040_epstall(&priv->eplist[1].ep, false);
    }
  else if (priv->zlp_stat != RP2040_ZLP_NONE)
    {
      rp2040_handle_zlp(priv);
    }
}

/****************************************************************************
 * Name: rp2040_usbintr_setup
 *
 * Description:
 *   Handle USB SETUP_REQ interrupt
 *
 ****************************************************************************/

static void rp2040_usbintr_setup(struct rp2040_usbdev_s *priv)
{
  uint16_t len;

  /* Read USB control request data */

  memcpy(&priv->ctrl, (void *)RP2040_USBCTRL_DPSRAM_SETUP_PACKET,
         USB_SIZEOF_CTRLREQ);
  len = GETUINT16(priv->ctrl.len);

  /* Reset PID and stall status in setup stage */

  priv->eplist[0].next_pid = 1;
  priv->eplist[1].next_pid = 1;
  priv->eplist[0].stalled = false;
  priv->eplist[1].stalled = false;

  /* ZLP type in status stage */

  priv->zlp_stat = USB_REQ_ISIN(priv->ctrl.type) ? RP2040_ZLP_IN_REPLY :
                                                   RP2040_ZLP_OUT_REPLY;

  if (USB_REQ_ISOUT(priv->ctrl.type) && len != priv->ep0datlen)
    {
      /* Receive the subsequent OUT data for the setup */

      priv->ep0reqlen = len;
      rp2040_epread(&priv->eplist[RP2040_EPINDEX(0x00)], len);
    }
  else
    {
      /* Start the setup */

      priv->ep0reqlen = 0;
      rp2040_ep0setup(priv);
    }
}

/****************************************************************************
 * Name: rp2040_usbintr_ep0out
 *
 * Description:
 *   Handle the end of EP0OUT data transfer
 *
 ****************************************************************************/

static void rp2040_usbintr_ep0out(struct rp2040_usbdev_s *priv,
                                  struct rp2040_ep_s *privep)
{
  int len;

  len = getreg32(privep->buf_ctrl)
        & RP2040_USBCTRL_DPSRAM_EP_BUFF_CTRL_LEN_MASK;

  if (len == 0)
    {
      privep->next_pid = 1;
      priv->ep0datlen = 0;
      return;
    }

  memcpy(priv->ep0data + priv->ep0datlen, privep->data_buf, len);
  priv->ep0datlen += len;

  if (priv->ep0datlen == priv->ep0reqlen)
    {
      priv->zlp_stat = RP2040_ZLP_NONE;
      rp2040_ep0setup(priv);
      priv->ep0datlen = 0;
    }
  else
    {
      rp2040_epread(privep, RP2040_EP0MAXPACKET);
    }
}

/****************************************************************************
 * Name: rp2040_usbintr_buffstat
 *
 * Description:
 *   Handle USB BUFF_STATUS interrupt
 *
 ****************************************************************************/

static bool rp2040_usbintr_buffstat(struct rp2040_usbdev_s *priv)
{
  uint32_t stat = getreg32(RP2040_USBCTRL_REGS_BUFF_STATUS);
  uint32_t bit;
  int i;
  struct rp2040_ep_s *privep;

  if (stat == 0)
    {
      return false;
    }

  usbtrace(TRACE_INTDECODE(RP2040_TRACEINTID_INTR_BUFFSTAT), stat & 0xffff);

  bit = 1;
  for (i = 0; i < 32 && stat != 0; i++)
    {
      if (stat & bit)
        {
          clrbits_reg32(bit, RP2040_USBCTRL_REGS_BUFF_STATUS);
          privep = &priv->eplist[RP2040_DPTOEP(i)];

          if (i == 1)
            {
              rp2040_usbintr_ep0out(priv, privep);
            }
          else
            {
              if (i == 0 && priv->dev_addr != 0)
                {
                  putreg32(priv->dev_addr, RP2040_USBCTRL_REGS_ADDR_ENDP);
                  priv->dev_addr = 0;
                }

              if (privep->in)
                {
                  if (!rp2040_rqempty(privep))
                    {
                      rp2040_txcomplete(privep);
                    }
                  else if (privep->pending_stall)
                    {
                      rp2040_epstall_exec(&privep->ep);
                    }
                }
              else
                {
                  rp2040_rxcomplete(privep);
                }
            }

          stat &= ~bit;
        }

      bit <<= 1;
    }

  return true;
}

/****************************************************************************
 * Name: rp2040_usbintr_busreset
 *
 * Description:
 *   Handle USB BUS_RESET interrupt
 *
 ****************************************************************************/

static void rp2040_usbintr_busreset(struct rp2040_usbdev_s *priv)
{
  int i;

  usbtrace(TRACE_INTDECODE(RP2040_TRACEINTID_INTR_BUSRESET), 0);

  putreg32(0, RP2040_USBCTRL_REGS_ADDR_ENDP);
  priv->dev_addr = 0;
  priv->zlp_stat = RP2040_ZLP_NONE;
  priv->next_offset = RP2040_USBCTRL_DPSRAM_DATA_BUF_OFFSET;

  for (i = 0; i < RP2040_NENDPOINTS; i++)
    {
      struct rp2040_ep_s *privep = &g_usbdev.eplist[i];

      rp2040_cancelrequests(privep);
    }

  rp2040_pullup(&g_usbdev.usbdev, false);
  if (g_usbdev.driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }

  clrbits_reg32(RP2040_USBCTRL_REGS_SIE_STATUS_BUS_RESET,
                RP2040_USBCTRL_REGS_SIE_STATUS);
}

/****************************************************************************
 * Name: rp2040_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int rp2040_usbinterrupt(int irq, void *context, void *arg)
{
  struct rp2040_usbdev_s *priv = (struct rp2040_usbdev_s *)arg;
  uint32_t stat;

