apache/nuttx/arch/arm/src/rp2040/rp2040_usbdev.c
  if (privep->stalled && privep->in)
    {
      rp2040_abortrequest(privep, privreq, -EBUSY);
      ret = -EBUSY;
    }

  /* Handle IN (device-to-host) requests */

  else if (privep->in)
    {
      /* Add the new request to the request queue for the IN endpoint */

      bool empty = rp2040_rqempty(privep);

      rp2040_rqenqueue(privep, privreq);
      usbtrace(TRACE_INREQQUEUED(privep->epphy), privreq->req.len);

      if (empty)
        {
          rp2040_wrrequest(privep);
        }
    }

  /* Handle OUT (host-to-device) requests */

  else
    {
      /* Add the new request to the request queue for the OUT endpoint */

      bool empty = rp2040_rqempty(privep);

      privep->txnullpkt = 0;
      rp2040_rqenqueue(privep, privreq);
      usbtrace(TRACE_OUTREQQUEUED(privep->epphy), privreq->req.len);

      /* This there a incoming data pending the availability of a request? */

      if (empty)
        {
          ret = rp2040_rdrequest(privep);
        }
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: rp2040_epcancel
 *
 * Description:
 *   Cancel an I/O request previously sent to an endpoint
 *
 ****************************************************************************/

static int rp2040_epcancel(struct usbdev_ep_s *ep,
                           struct usbdev_req_s *req)
{
  struct rp2040_ep_s *privep = (struct rp2040_ep_s *)ep;
  irqstate_t flags;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(RP2040_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  usbtrace(TRACE_EPCANCEL, privep->epphy);

  /* Remove request from req_queue */

  flags = enter_critical_section();
  rp2040_cancelrequests(privep);
  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: rp2040_epstall_exec
 *
 * Description:
 *   Stall endpoint immediately
 *
 ****************************************************************************/

static int rp2040_epstall_exec_nolock(struct usbdev_ep_s *ep)
{
  struct rp2040_ep_s *privep = (struct rp2040_ep_s *)ep;

  usbtrace(TRACE_EPSTALL, privep->epphy);

  if (privep->epphy == 0)
    {
      setbits_reg32(privep->in ?
                     RP2040_USBCTRL_REGS_EP_STALL_ARM_EP0_IN :
                     RP2040_USBCTRL_REGS_EP_STALL_ARM_EP0_OUT,
                    RP2040_USBCTRL_REGS_EP_STALL_ARM);
    }

  rp2040_update_buffer_control(privep,
                    0,
                    RP2040_USBCTRL_DPSRAM_EP_BUFF_CTRL_STALL);

  privep->pending_stall = false;

  return OK;
}

static int rp2040_epstall_exec(struct usbdev_ep_s *ep)
{
  struct rp2040_ep_s *privep = (struct rp2040_ep_s *)ep;
  struct rp2040_usbdev_s *priv = privep->dev;
  irqstate_t flags;
  int ret;

  flags = spin_lock_irqsave(&priv->lock);
  ret = rp2040_epstall_exec_nolock(ep);
  spin_unlock_irqrestore(&priv->lock, flags);
  return ret;
}

/****************************************************************************
 * Name: rp2040_epstall
 *
 * Description:
 *   Stall or resume and endpoint
 *
 ****************************************************************************/

static int rp2040_epstall(struct usbdev_ep_s *ep, bool resume)
{
  struct rp2040_ep_s *privep = (struct rp2040_ep_s *)ep;
  struct rp2040_usbdev_s *priv = privep->dev;
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  if (resume)
    {
      usbtrace(TRACE_EPRESUME, privep->epphy);
      privep->stalled = false;
      if (privep->epphy == 0)
        {
          clrbits_reg32(privep->in ?
                         RP2040_USBCTRL_REGS_EP_STALL_ARM_EP0_IN :
                         RP2040_USBCTRL_REGS_EP_STALL_ARM_EP0_OUT,
                        RP2040_USBCTRL_REGS_EP_STALL_ARM);
        }

      rp2040_update_buffer_control(privep,
                        ~(RP2040_USBCTRL_DPSRAM_EP_BUFF_CTRL_STALL),
                        0);

      privep->next_pid = 0;
      priv->zlp_stat = RP2040_ZLP_NONE;
    }
  else
    {
      privep->stalled = true;

      if (privep->epphy == 0 && !rp2040_rqempty(privep))
        {
          /* EP0 IN Transfer ongoing : postpone the stall until the end */

          privep->pending_stall = true;
        }
      else
        {
          /* Stall immediately */

          rp2040_epstall_exec_nolock(ep);
        }

      priv->zlp_stat = RP2040_ZLP_NONE;
    }

  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

/****************************************************************************
 * Device Methods
 ****************************************************************************/

/****************************************************************************
 * Name: rp2040_allocep
 *
 * Description:
 *   Allocate an endpoint matching the parameters
 *
 * Input Parameters:
 *   eplog  - 7-bit logical endpoint number (direction bit ignored).
 *            Zero means that any endpoint matching the other requirements
 *            will suffice.  The assigned endpoint can be found in the eplog
 *            field.
 *   in     - true: IN (device-to-host) endpoint requested
 *   eptype - Endpoint type.
 *            One of {USB_EP_ATTR_XFER_ISOC,
 *                    USB_EP_ATTR_XFER_BULK,
 *                    USB_EP_ATTR_XFER_INT}
 *
 ****************************************************************************/

static struct usbdev_ep_s *rp2040_allocep(struct usbdev_s *dev,
                                          uint8_t eplog, bool in,
                                          uint8_t eptype)
{
  struct rp2040_usbdev_s *priv = (struct rp2040_usbdev_s *)dev;
  struct rp2040_ep_s *privep;
  int epphy;
  int epindex;
  int dpindex;

  usbtrace(TRACE_DEVALLOCEP, (uint16_t)eplog);

  /* Ignore any direction bits in the logical address */

  epphy = USB_EPNO(eplog);
  epindex = RP2040_EPINDEX(eplog);
  dpindex = RP2040_DPINDEX(eplog);

  if ((priv->used & 1 << epphy) && (epphy != 0))
    {
      uinfo("ep is still used\n");
      return NULL;
    }

  priv->used |= 1 << epphy;

  privep = &priv->eplist[epindex];
  privep->in = in;
  privep->type = eptype;
  privep->epphy = epphy;
  privep->ep.eplog = eplog;

  privep->next_pid = 0;
  privep->stalled = false;
  privep->buf_ctrl = RP2040_USBCTRL_DPSRAM_EP_BUF_CTRL(dpindex);

